파이썬 기초를 알아봅시다!!


x = input(x)             # x에 문자열 입력을 받는다. 
x = int(x)               # x는 정수이다
x = float(x)             # x는 실수이다
x = int(input("숫자"))   # x에 문자열을 입력받고 그 입력받은 값을 정수로 만든다. 단 문자열사용 X   
x = float(input("숫자")) # x에 문자열을 입력받고 그 입력받은 값을 정수로 만든다. 단 문자열사용 X
x = 5                    # x에 정수  5를 대입     ==(x = 정수)
x = "5"                  # x에 문자열 "5"를 넣는다 == (x = 문자열) 

#숫자
x = 5                    # x는 정수 5 이다.
b = 2                    # b는 정수 2 이다.

( + )
x + b = 7                # x(5) + b(2) == 7 (x 더하기 b 는 7 이다.)
x += b                   # x = x+b (x = 7) 

( - )
x - b = 3                # x(5) - b(2) = 3 (x 뺴기 b 는 3이다.)
x -= b = 3               # x = x-b == 3 (x = 3)

( * , ** )
x * b = 10               # x(5) * b(2) = 10 (5 곱하기 2) 
x ** b = 25              # x(5) ^ b(2) = 25 (5 곱하기 5)
x *= b = 10              # x(5) = x(5) * b(2) (x 곱하기 2)
x **= b =25              # x = x(5) ^ b(2)  ( x 를 b 만큼 제곱)
# * = 곱하기,   ** = 제곱

( / , // )
x(5) / b(2) = 2.5        # x(5) / b(2) = 2.5 ( 5 나누기 2 )
x(5) // b(2) = 2         # x(5) // b(2) = 2  ( 5 나누기 2 몫 구하기 (정수))

( % )
x(5) % b(2) = 1          # x(5) % b(2) = 1  (나머지 구하기)
x(5) %= b(2) = 1
